AUTO_config_TK_pesok/src/Documents/ЗакрытиеСмены/ЗакрытиеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеСмены</name>
  <registerRecords>AccumulationRegister.ПартииТоваровКомпании</registerRecords>
  <registerRecords>AccumulationRegister.ПриходованиеТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваровКомпании</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <comment>Флаг отражения документа в регламентированном учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>Тип цен отгрузки</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписыватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовое</name>
      <comment>Количество номенклатуры в базовых единицах (коэффициент=1)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС по номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС по номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкцизногоНалога</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <comment>Итоговая сумма по строке документа со всеми налогами</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <comment>Сумма скидки по строке документа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <comment>Процент скидки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Возврат</name>
      <comment>Определяет тип операции Истина-возврат, Ложь-продажа</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассификаторПродажи</name>
      <type>
        <types>CatalogRef.КлассификаторПродаж</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СнятыеКассы</name>
    <attributes>
      <name>КассоваяСмена</name>
      <type>
        <types>DocumentRef.ТК_КассоваяСмена</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <attributes>
      <name>КассаККМ</name>
      <type>
        <types>CatalogRef.КассыККМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <type>
        <types>CatalogRef.ЭквайринговыеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>22</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>ОсновнойКонтрагент</name>
      <description>Основной контрагент</description>
    </items>
    <items>
      <name>ЧастноеЛицо</name>
      <description>Частное лицо</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование контрагента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <comment>Вид контрагента</comment>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквзита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Дополнительная информация о контрагенте</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодWERA</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаРаботы</name>
    <comment>1 - Корректировка 2 - Замена накладных</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПротоколыЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерТабак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <comment>Тип</comment>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <comment>Вид</comment>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <comment>Представление</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Documents/ЗакрытиеСмены/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	#Область Проведение
	
	Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
		
		ИсточникиДанных = Новый Соответствие;
		
		Возврат ИсточникиДанных; 
		
	КонецФункции
	
	Функция ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса)
		
		ИмяРегистра = "ВтТаблицаТовары";
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ЗакрытиеСменыТовары.НомерСтроки КАК НомерСтроки,
		               |	ЗакрытиеСменыТовары.Номенклатура КАК Номенклатура,
		               |	ЗакрытиеСменыТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ЗакрытиеСменыТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	ЗакрытиеСменыТовары.Коэффициент КАК Коэффициент,
		               |	ЗакрытиеСменыТовары.КоличествоБазовое КАК Количество,
		               |	ЗакрытиеСменыТовары.Цена КАК Цена,
		               |	ЗакрытиеСменыТовары.Сумма КАК Сумма,
		               |	ЗакрытиеСменыТовары.СтавкаНДС КАК СтавкаНДС,
		               |	ЗакрытиеСменыТовары.СуммаНДС КАК СуммаНДС,
		               |	ЗакрытиеСменыТовары.СуммаАкцизногоНалога КАК СуммаАкцизногоНалога,
		               |	ЗакрытиеСменыТовары.СуммаВсего КАК СуммаВсего,
		               |	ЗакрытиеСменыТовары.СуммаСкидки КАК СуммаСкидки,
		               |	ЗакрытиеСменыТовары.ПроцентСкидки КАК ПроцентСкидки,
		               |	ЗакрытиеСменыТовары.Возврат КАК Возврат,
		               |	ЗакрытиеСменыТовары.Ссылка.ХозОперация КАК ХозОперация,
		               |	ЗакрытиеСменыТовары.Ссылка.СкладКомпании КАК СкладКомпании,
		               |	ЗакрытиеСменыТовары.КлассификаторПродажи КАК КлассификаторПродажи,
		               |	ВЫБОР
		               |		КОГДА ЗакрытиеСменыТовары.КлассификаторПродажи = ЗНАЧЕНИЕ(Справочник.КлассификаторПродаж.ПустаяСсылка)
		               |			ТОГДА 100000
		               |		ИНАЧЕ ЗакрытиеСменыТовары.КлассификаторПродажи.Код
		               |	КОНЕЦ КАК Порядок
		               |ПОМЕСТИТЬ ВтТаблицаТовары
		               |ИЗ
		               |	Документ.ЗакрытиеСмены.Товары КАК ЗакрытиеСменыТовары
		               |ГДЕ
		               |	ЗакрытиеСменыТовары.Ссылка = &Ссылка
		               |	И ЗакрытиеСменыТовары.Номенклатура <> &НоменклатураВыигрыш";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	Функция ТекстЗапросаТаблицаОстаткиТоваровКомпании(Запрос, ТекстыЗапроса, Регистры)
		
		ИмяРегистра = "ОстаткиТоваровКомпании";
		
		Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
			Возврат "";
		КонецЕсли; 
		
		Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
			ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
		КонецЕсли; 
		
		ТекстЗапроса ="ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Период КАК Период,
		|	ВтТаблицаТовары.СкладКомпании КАК СкладКомпании,
		|	ВтТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВтТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ВтТаблицаТовары.Количество) КАК Количество,
		|	ВтТаблицаТовары.ХозОперация КАК ХозОперация
		|ИЗ
		|	ВтТаблицаТовары КАК ВтТаблицаТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВтТаблицаТовары.ХозОперация,
		|	ВтТаблицаТовары.СкладКомпании,
		|	ВтТаблицаТовары.Номенклатура,
		|	ВтТаблицаТовары.ХарактеристикаНоменклатуры"; 
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
		Возврат ТекстЗапроса;
		
	КонецФункции
	
	
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
		
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		Запрос = Новый Запрос;
		
		//МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		//Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Реквизиты = ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		ДополнитьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства,Реквизиты);
		
		ТекстыЗапроса = Новый СписокЗначений;
		
		Если ДополнительныеСвойства.Свойство("ПроведениеПоПартиям") Тогда	
			ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
			ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);	
			ПартионныйУчет.ПодготовитьТаблицуСписанияПартийТоваров(Запрос, ДополнительныеСвойства);
			ПартионныйУчет.ПодготовитьТаблицуПродажТоваров(Запрос, ДополнительныеСвойства);
			ПартионныйУчет.ПодготовитьТаблицуОприходованияТоваров(Запрос, ДополнительныеСвойства);
			
			
		Иначе
			Если НЕ ПроведениеСервер.ЕстьТаблицаЗапроса("ВтТаблицаТовары", ТекстыЗапроса) Тогда
				ТекстЗапросаВтТаблицаТовары(Запрос, ТекстыЗапроса);
			КонецЕсли; 
			
			Если ДополнительныеСвойства.ПроводитьПоОстаткам Тогда
				
				ТекстЗапросаТаблицаОстаткиТоваровКомпании(Запрос, ТекстыЗапроса, Регистры);
				
			КонецЕсли;
			
			
			
			ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);	
			
			Запрос.Текст = "";
			
			
			ПартионныйУчет.ПодготовитьТаблицуСписанияПартийТоваров(Запрос, ДополнительныеСвойства);
			ПартионныйУчет.ПодготовитьТаблицуПродажТоваров(Запрос, ДополнительныеСвойства);
			ПартионныйУчет.ПодготовитьТаблицуОприходованияТоваров(Запрос, ДополнительныеСвойства);
		КонецЕсли;
		
		
	КонецПроцедуры
	
	Функция ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеДокумента.Ссылка КАК Ссылка,
		|	ДанныеДокумента.ХозОперация КАК ХозОперация,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.Дата КАК Период,
		|	ДанныеДокумента.ВалютаДокумента КАК Валюта,
		|	ДанныеДокумента.ТорговаяПлощадка КАК ТорговаяПлощадка,
		|	ДанныеДокумента.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	ДанныеДокумента.СкладКомпании КАК СкладКомпании,
		|	ДанныеДокумента.СкладКомпании.ТипЦенСебестоимости КАК ТипЦенСебестоимости,
		|	ДанныеДокумента.КурсДокумента КАК КурсДокумента,
		|	ДанныеДокумента.РегламентированныйУчет КАК РегламентированныйУчет,
		|	ДанныеДокумента.СписыватьОстатки КАК СписыватьОстатки
		|ИЗ
		|	Документ.ЗакрытиеСмены КАК ДанныеДокумента
		|ГДЕ
		|	ДанныеДокумента.Ссылка = &Ссылка";
		
		Реквизиты = Запрос.Выполнить().Выбрать();
		Реквизиты.Следующий();
		
		Запрос.УстановитьПараметр("Ссылка",                                   ДокументСсылка);
		Запрос.УстановитьПараметр("МоментВремени",                            Новый МоментВремени(Реквизиты.Период,ДокументСсылка));
		
		Запрос.УстановитьПараметр("Период",                                   Реквизиты.Период);
		Запрос.УстановитьПараметр("НачалоМесяцаПериода",                      НачалоМесяца(Реквизиты.Период));
		Запрос.УстановитьПараметр("Валюта",                                   Реквизиты.Валюта);
		Запрос.УстановитьПараметр("Организация",                              Реквизиты.Организация);
		Запрос.УстановитьПараметр("ПодразделениеКомпании",                    Реквизиты.ПодразделениеКомпании);
		Запрос.УстановитьПараметр("ТорговаяПлощадка",                         Реквизиты.ТорговаяПлощадка);
		Запрос.УстановитьПараметр("СкладКомпании",                            Реквизиты.СкладКомпании);
		Запрос.УстановитьПараметр("ТипЦенСебестоимости",                      Реквизиты.ТипЦенСебестоимости);
		Запрос.УстановитьПараметр("НоменклатураВыигрыш",                      Справочники.Номенклатура.НоменклатураВыигрышЛотерея());

		Возврат Реквизиты;	
		
	КонецФункции
	
	Процедура ДополнитьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства,Реквизиты)
		
		ДополнительныеСвойства.ДляПроведения.Вставить("ПодразделениеКомпании",Реквизиты.ПодразделениеКомпании);
		ДополнительныеСвойства.ДляПроведения.Вставить("ТорговаяПлощадка",Реквизиты.ТорговаяПлощадка);
		ДополнительныеСвойства.ДляПроведения.Вставить("СкладКомпании",Реквизиты.СкладКомпании);
		ДополнительныеСвойства.ДляПроведения.Вставить("Контрагент",Справочники.Контрагенты.ЧастноеЛицо);
		ДополнительныеСвойства.ДляПроведения.Вставить("ТипЦенСебестоимости",Реквизиты.ТипЦенСебестоимости);
		ДополнительныеСвойства.ДляПроведения.Вставить("Валюта",Реквизиты.Валюта);
		ДополнительныеСвойства.ДляПроведения.Вставить("КурсДокумента",Реквизиты.КурсДокумента);
		ДополнительныеСвойства.ДляПроведения.Вставить("ТипЦенСебестоимости",Реквизиты.ТипЦенСебестоимости);
		ДополнительныеСвойства.ДляПроведения.Вставить("РегламентированныйУчет",Реквизиты.РегламентированныйУчет);
		ДополнительныеСвойства.ДляПроведения.Вставить("ХозОперация",Реквизиты.ХозОперация);
		ДополнительныеСвойства.Вставить("ПроводитьПоОстаткам",Реквизиты.СписыватьОстатки);
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	
	
	
	
	
	#Область Последовательность
	
	Процедура ИнициалзироватьДанныеПоследовательности(Ссылка,ДополнительныеСвойства) Экспорт
		
		ТаблицыДляПоследовательности = Новый Структура("ПартииТоваров");	
		
		ТаблицаПоследовательности = Новый ТаблицаЗначений;
		ТаблицаПоследовательности.Колонки.Добавить("Период");
		ТаблицаПоследовательности.Колонки.Добавить("Регистратор");
		ТаблицаПоследовательности.Колонки.Добавить("СкладКомпании");
		
		
		НоваяСтрока = ТаблицаПоследовательности.Добавить();
		НоваяСтрока.Регистратор   = Ссылка;
		НоваяСтрока.СкладКомпании = Ссылка.СкладКомпании;
		НоваяСтрока.Период   	  = Ссылка.Дата;
		ТаблицыДляПоследовательности.ПартииТоваров = ТаблицаПоследовательности;
		
		
		
		ДополнительныеСвойства.Вставить("ТаблицыДляПоследовательности",ТаблицыДляПоследовательности);
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область ПрограммныйИнтерфейс
	
	// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
	Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)
		|	И ЗначениеРазрешено(ПодразделениеКомпании)
		|	И ЗначениеРазрешено(ТорговаяПлощадка)";
		
		Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
		
	КонецПроцедуры
	
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	
	#КонецОбласти
	
	
	
#КонецЕсли
